308.5_CE615_Spring2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-06 Mon 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CE 615: Structural Design for Fire - Spring 2025</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />
</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">
<h1 class="title">CE 615: Structural Design for Fire - Spring 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4550b2a">Basic Information</a></li>
<li><a href="#org33e3ce5">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#orgc145b04">Course Policies</a></li>
<li><a href="#org1ddc58b">Calendar (tentative)</a></li>
</ul>
</div>
</div>



<div id="outline-container-org4550b2a" class="outline-2">
<h2 id="org4550b2a">Basic Information</h2>
<div class="outline-text-2" id="text-org4550b2a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class timings</th>
<th scope="col" class="org-left">Wednesday, Friday, 15:30-16:60 hrs</th>
</tr>

<tr>
<th scope="col" class="org-left">Class location</th>
<th scope="col" class="org-left">AB 7/210</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
</tr>
</tbody>
</table>


<p>
Remaining information will be updated soon.
</p>
</div>
</div>

<div id="outline-container-org33e3ce5" class="outline-2">
<h2 id="org33e3ce5">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org33e3ce5">
</div>
<div id="outline-container-orga785fbf" class="outline-3">
<h3 id="orga785fbf">Objectives</h3>
<div class="outline-text-3" id="text-orga785fbf">
<ul class="org-ul">
<li>To learn about the effects of fire on reinforced concrete and steel structures.</li>
<li>To learn about the behavior and characterization of fires of different kinds.</li>
<li>To be able to design reinforced concrete and steel structures under fire conditions.</li>
</ul>
</div>
</div>

<div id="outline-container-org897e07d" class="outline-3">
<h3 id="org897e07d">Syllabus</h3>
<div class="outline-text-3" id="text-org897e07d">
<ul class="org-ul">
<li>Fire characteristics (combustion, ignition, flammability limits, etc.)</li>
<li>Properties of steel and concrete at high temperatures.</li>
<li>Heat transfer mechanisms: conduction, convection and radiation. Mathematical modeling of the heat transfer problem.</li>
<li>Fire as a hazard; development of a fire in the open and in a compartment.</li>
<li>Stages of a compartment fire: pre-flashover, flashover and post-flashover.</li>
<li>Characterization of a fire through time-temperature and time-HRR; t<sup>2</sup> fire model.</li>
<li>Estimation of fire curves through fire load energy density and compartment characteristics. Ventilation factor; fuel vs. ventilation controlled fire.</li>
<li>Design and parametric fire curves.</li>
<li>Heat transfer within concrete structures (semi-infinite idealization) and steel structures (lumped capacity idealization).</li>
<li>Empirical and code-based methods to compute temperature within structural systems.</li>
<li>Design of steel structures under fire.</li>
<li>Design of reinforced concrete structures under fire; 500 isotherm method, zone method.</li>
<li>Equivalent fire severity.</li>
</ul>
</div>
</div>

<div id="outline-container-org4980b85" class="outline-3">
<h3 id="org4980b85">Textbook</h3>
<div class="outline-text-3" id="text-org4980b85">
<ul class="org-ul">
<li>Fire-resistant Design of Structures by S. Chandrasekaran and G. Srivastava, CRC Press.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5fd866" class="outline-3">
<h3 id="orgf5fd866">Reference Books</h3>
<div class="outline-text-3" id="text-orgf5fd866">
<ul class="org-ul">
<li>Fundamentals of Heat and Mass Transfer by T.L. Bergman, A.S. Lavine, F.P. Incropera and D.P. Dewitt, John Wiley &amp; Sons.</li>
<li>An Introduction to Fire Dynamics by D. Drysdale, Wiley.</li>
<li>Temperature calculation in Fire Safety Engineering by U. Wickstrom, Springer.</li>
</ul>
</div>
</div>

<div id="outline-container-org12d56b9" class="outline-3">
<h3 id="org12d56b9">Codes and Standards</h3>
<div class="outline-text-3" id="text-org12d56b9">
<ul class="org-ul">
<li>National Building Code (NBC) 2016 of India.</li>
<li>IS 800 (steel) and IS 456 (reinforced concrete)</li>
<li>Eurocode EN 1990:2002 (basis of structural design)</li>
<li>Eurocode EN 1991-1-1 and EN 1991-1-2 (actions)</li>
<li>Eurocode EN 1992-1-1 and EN 1992-1-2 (reinforced concrete)</li>
<li>Eurocode EN 1993-1-1 and EN 1993-1-2 (reinforced concrete)</li>
<li>Eurocode EN 1996-1-1 and EN 1996-1-2 (masonry)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc145b04" class="outline-2">
<h2 id="orgc145b04">Course Policies</h2>
<div class="outline-text-2" id="text-orgc145b04">
</div>
<div id="outline-container-orgf6bd3d2" class="outline-3">
<h3 id="orgf6bd3d2">Etiquette</h3>
<div class="outline-text-3" id="text-orgf6bd3d2">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "CE615" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between CE and 615)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5ee18a" class="outline-3">
<h3 id="orgc5ee18a">Cheating</h3>
<div class="outline-text-3" id="text-orgc5ee18a">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-org0583c23" class="outline-3">
<h3 id="org0583c23">Grading</h3>
<div class="outline-text-3" id="text-org0583c23">
<p>
Following will be the weightage of different components of assessment
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">30%</td>
</tr>

<tr>
<td class="org-left">Group projects</td>
<td class="org-right">30%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-right">20% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4f87135" class="outline-3">
<h3 id="org4f87135">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-org4f87135">
<ul class="org-ul">
<li>Assignments will entail analysis/practical problems, reports, etc. and may be individual or group</li>
<li>Group projects will involve more aggregating tasks including small amount of coding, use of a software, or design of larger systems.</li>
</ul>
</div>
</div>

<div id="outline-container-org04103ce" class="outline-3">
<h3 id="org04103ce">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-org04103ce">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-org1ddc58b" class="outline-2">
<h2 id="org1ddc58b">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-org1ddc58b">
</div>
<div id="outline-container-orgdd0fd0f" class="outline-3">
<h3 id="orgdd0fd0f">[L1] Jan 03, Fri</h3>
<div class="outline-text-3" id="text-orgdd0fd0f">
<ul class="org-ul">
<li>Introduction to fire engineering and design.</li>
</ul>
</div>
</div>
<div id="outline-container-org611893a" class="outline-3">
<h3 id="org611893a">[L2] Jan 08, Wed</h3>
<div class="outline-text-3" id="text-org611893a">
<ul class="org-ul">
<li>Analysis of a building. Load calculations. IS 875-1. Characteristics loads.</li>
</ul>
</div>
</div>
<div id="outline-container-org57ca247" class="outline-3">
<h3 id="org57ca247">[L3] Jan 10, Fri</h3>
<div class="outline-text-3" id="text-org57ca247">
<ul class="org-ul">
<li>Load calculations. IS 875-2. Load path and distribution. Characteristic loads.</li>
</ul>
</div>
</div>
<div id="outline-container-org4e4d1ec" class="outline-3">
<h3 id="org4e4d1ec">[L4] Jan 15, Wed</h3>
<div class="outline-text-3" id="text-org4e4d1ec">
<ul class="org-ul">
<li>Structural systems. Framed systems and their analysis. Typology of different components of structural systems.</li>
</ul>
</div>
</div>
<div id="outline-container-org9a6fea8" class="outline-3">
<h3 id="org9a6fea8">[L5] Jan 17, Fri</h3>
<div class="outline-text-3" id="text-org9a6fea8">
<ul class="org-ul">
<li>Introduction to IS 456.</li>
<li>Discussions on materials, constituents of concrete, characteristic strength, construction practices.</li>
<li>Design philosophies. Partial safety factors.</li>
<li>Properties of concrete.</li>
</ul>
</div>
</div>
<div id="outline-container-org9ebc826" class="outline-3">
<h3 id="org9ebc826">[L6] Jan 22, Wed</h3>
<div class="outline-text-3" id="text-org9ebc826">
<ul class="org-ul">
<li>Design of RC beams.</li>
<li>Concept of neutral axis of homogeneous and heterogeneous sections.</li>
<li>Assumptions in the behaviour of RC beams. Concept of balanced, under-reinforced and over-reinforced sections.</li>
<li>Analysis and design of singly-reinforced RC beams.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc9ea01" class="outline-3">
<h3 id="orgbc9ea01">[L7] Jan 24, Fri</h3>
<div class="outline-text-3" id="text-orgbc9ea01">
<ul class="org-ul">
<li>Design of RC beams.</li>
<li>Consideration of over-reinforced sections.</li>
<li>Analysis and design of doubly-reinforced sections.</li>
</ul>
</div>
</div>
<div id="outline-container-org22bc39e" class="outline-3">
<h3 id="org22bc39e">[L8] Jan 29, Wed</h3>
<div class="outline-text-3" id="text-org22bc39e">
<ul class="org-ul">
<li>Failure modes of an RCC beam.</li>
<li>Design of RC beams under shear.</li>
</ul>
</div>
</div>
<div id="outline-container-org5dfce9c" class="outline-3">
<h3 id="org5dfce9c">[L9] Jan 31, Fri</h3>
<div class="outline-text-3" id="text-org5dfce9c">
<ul class="org-ul">
<li>Design of RC beams.</li>
<li>Consideration of T and L beams.</li>
<li>Provisions of the Code for design of RCC beams.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf461cb2" class="outline-3">
<h3 id="orgf461cb2">[L10] Feb 05, Wed</h3>
<div class="outline-text-3" id="text-orgf461cb2">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org4e450c8" class="outline-3">
<h3 id="org4e450c8">[L11] Feb 07, Fri</h3>
<div class="outline-text-3" id="text-org4e450c8">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org04f30f6" class="outline-3">
<h3 id="org04f30f6">[L12] Feb 12, Wed</h3>
<div class="outline-text-3" id="text-org04f30f6">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdbcb2e5" class="outline-3">
<h3 id="orgdbcb2e5">[L13] Feb 14, Fri</h3>
<div class="outline-text-3" id="text-orgdbcb2e5">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org5a15f27" class="outline-3">
<h3 id="org5a15f27">[L14] Feb 19, Wed</h3>
<div class="outline-text-3" id="text-org5a15f27">
<ul class="org-ul">
<li>Design of RC slabs.</li>
<li>Behavior of slab as a plate, torsion near supported edges. Different cases of supporting conditions.</li>
<li>One-way vs. two-way slab action.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd84be8" class="outline-3">
<h3 id="orgfd84be8">[L15] Feb 21, Fri</h3>
<div class="outline-text-3" id="text-orgfd84be8">
<ul class="org-ul">
<li>Design of RC slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-org04743cb" class="outline-3">
<h3 id="org04743cb">Feb 26, Wed - no class</h3>
<div class="outline-text-3" id="text-org04743cb">
<ul class="org-ul">
<li>Maha Shivaratri</li>
</ul>
</div>
</div>
<div id="outline-container-orge7cdb31" class="outline-3">
<h3 id="orge7cdb31">[L16] Feb 28, Fri</h3>
<div class="outline-text-3" id="text-orge7cdb31">
<ul class="org-ul">
<li>Design of RC slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-orgee1e16a" class="outline-3">
<h3 id="orgee1e16a">Mar 1 - 7: Mid semester exam week</h3>
</div>
<div id="outline-container-org875ec43" class="outline-3">
<h3 id="org875ec43">Mar 8 - 16: Mid semester recess</h3>
</div>
<div id="outline-container-orgefff417" class="outline-3">
<h3 id="orgefff417">[L17] Mar 19, Wed</h3>
<div class="outline-text-3" id="text-orgefff417">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
<li>Types of footings. Eccentricity. Failure modes and design considerations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7ba009" class="outline-3">
<h3 id="orgc7ba009">[L18] Mar 21, Fri</h3>
<div class="outline-text-3" id="text-orgc7ba009">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-org78a9a37" class="outline-3">
<h3 id="org78a9a37">[L19] Mar 26, Wed</h3>
<div class="outline-text-3" id="text-org78a9a37">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-org3484da3" class="outline-3">
<h3 id="org3484da3">[L20] Mar 28, Fri</h3>
<div class="outline-text-3" id="text-org3484da3">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org2eb2273" class="outline-3">
<h3 id="org2eb2273">[L21] Apr 02, Wed</h3>
<div class="outline-text-3" id="text-org2eb2273">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org098ebe9" class="outline-3">
<h3 id="org098ebe9">[L22] Apr 04, Fri</h3>
<div class="outline-text-3" id="text-org098ebe9">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org6d2e32c" class="outline-3">
<h3 id="org6d2e32c">[L23] Apr 09, Wed</h3>
<div class="outline-text-3" id="text-org6d2e32c">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org0a55b7f" class="outline-3">
<h3 id="org0a55b7f">[L24] Apr 11, Fri</h3>
<div class="outline-text-3" id="text-org0a55b7f">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa8ad99" class="outline-3">
<h3 id="orgaa8ad99">[L25] Apr 16, Wed</h3>
<div class="outline-text-3" id="text-orgaa8ad99">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org87ddfe9" class="outline-3">
<h3 id="org87ddfe9">Apr 18, Fri - no class</h3>
<div class="outline-text-3" id="text-org87ddfe9">
<ul class="org-ul">
<li>Good Friday</li>
</ul>
</div>
</div>
<div id="outline-container-org88ff69b" class="outline-3">
<h3 id="org88ff69b">[L26] Apr 23, Wed</h3>
<div class="outline-text-3" id="text-org88ff69b">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org1cda0c1" class="outline-3">
<h3 id="org1cda0c1">Apr 24 - 30: End semester exam week</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
Contact: 
<a href='mailto:gauravs@iitgn.ac.in'>gauravs@iitgn.ac.in</a> (Work) |
<a href='mailto:it.gaurav@gmail.com'>it.gaurav@gmail.com</a> (Personal)
<br>
Created completely through <a href='https://www.gnu.org/software/emacs/'>Gnu Emacs</a> and <a href='https://orgmode.org'>Org Mode</a> (<a href='https://github.com/gaurav-iitgn/gaurav-iitgn.github.io'>source code</a>)
</footer>
</div>
</body>
</html>
